Revit 2026 API

# ColorFillSchemeEntryGetIntegerValue Method

---

Gets the Integer value stored within the entry.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetIntegerValue()
```
```vb
Public Function GetIntegerValue As Integer
```
```cpp
public:
int GetIntegerValue()
```
```fsharp
member GetIntegerValue : unit -> int
```

#### Return Value

Int32 The Integer value contained in the entry.

This method should only be used if the StorageType property reports the type of the entry as a Integer.

#### Reference

ColorFillSchemeEntry Class

Autodesk.Revit.DB Namespace